import React from "react";
import {
  LineChart,
  Line,
  XAxis,
  YAxis,
  CartesianGrid,
  Tooltip,
  Legend,
  ResponsiveContainer,
} from "recharts";

const data = [
  {
    name: "1 ",
    폐어구류: 4000,
    초목류: 2400,
    대형투기쓰레기류: 2400,
    생활쓰레기류: 1500,
    부표류: 800,
    합계: 4500,
  },
  {
    name: "2 ",
    폐어구류: 3000,
    초목류: 1398,
    대형투기쓰레기류: 2210,
    생활쓰레기류: 1000,
    부표류: 600,
    합계: 5000,
  },
  {
    name: "3 ",
    폐어구류: 2000,
    초목류: 9800,
    대형투기쓰레기류: 2290,
    생활쓰레기류: 1200,
    부표류: 500,
    합계: 7000,
  },
  {
    name: "4 ",
    폐어구류: 2780,
    초목류: 3908,
    대형투기쓰레기류: 2000,
    생활쓰레기류: 1300,
    부표류: 700,
    합계: 7000,
  },
  {
    name: "5 ",
    폐어구류: 1890,
    초목류: 4800,
    대형투기쓰레기류: 2181,
    생활쓰레기류: 900,
    부표류: 400,
    합계: 4000,
  },
  {
    name: "6 ",
    폐어구류: 2390,
    초목류: 3800,
    대형투기쓰레기류: 2500,
    생활쓰레기류: 1100,
    부표류: 600,
    합계: 8000,
  },
  {
    name: "7 ",
    폐어구류: 3490,
    초목류: 4300,
    대형투기쓰레기류: 2100,
    생활쓰레기류: 1200,
    부표류: 800,
    합계: 9000,
  },
  {
    name: "8 ",
    폐어구류: 4000,
    초목류: 2400,
    대형투기쓰레기류: 2400,
    생활쓰레기류: 1500,
    부표류: 800,
    합계: 4500,
  },
  {
    name: "9 ",
    폐어구류: 3000,
    초목류: 1398,
    대형투기쓰레기류: 2210,
    생활쓰레기류: 1000,
    부표류: 600,
    합계: 5000,
  },
  {
    name: "10 ",
    폐어구류: 2000,
    초목류: 9800,
    대형투기쓰레기류: 2290,
    생활쓰레기류: 1200,
    부표류: 500,
    합계: 7000,
  },
  {
    name: "11 ",
    폐어구류: 2780,
    초목류: 3908,
    대형투기쓰레기류: 2000,
    생활쓰레기류: 1300,
    부표류: 700,
    합계: 7000,
  },
  {
    name: "12 ",
    폐어구류: 1890,
    초목류: 4800,
    대형투기쓰레기류: 2181,
    생활쓰레기류: 900,
    부표류: 400,
    합계: 4000,
  },
  {
    name: "13 ",
    폐어구류: 2390,
    초목류: 3800,
    대형투기쓰레기류: 2500,
    생활쓰레기류: 1100,
    부표류: 600,
    합계: 8000,
  },
  {
    name: "14 ",
    폐어구류: 3490,
    초목류: 4300,
    대형투기쓰레기류: 2100,
    생활쓰레기류: 1200,
    부표류: 800,
    합계: 9000,
  },
  {
    name: "15 ",
    폐어구류: 4000,
    초목류: 2400,
    대형투기쓰레기류: 2400,
    생활쓰레기류: 1500,
    부표류: 800,
    합계: 4500,
  },
  {
    name: "16 ",
    폐어구류: 3000,
    초목류: 1398,
    대형투기쓰레기류: 2210,
    생활쓰레기류: 1000,
    부표류: 600,
    합계: 5000,
  },
  {
    name: "17 ",
    폐어구류: 2000,
    초목류: 9800,
    대형투기쓰레기류: 2290,
    생활쓰레기류: 1200,
    부표류: 500,
    합계: 7000,
  },
  {
    name: "18 ",
    폐어구류: 2780,
    초목류: 3908,
    대형투기쓰레기류: 2000,
    생활쓰레기류: 1300,
    부표류: 700,
    합계: 7000,
  },
  {
    name: "19 ",
    폐어구류: 1890,
    초목류: 4800,
    대형투기쓰레기류: 2181,
    생활쓰레기류: 900,
    부표류: 400,
    합계: 4000,
  },
  {
    name: "20 ",
    폐어구류: 2390,
    초목류: 3800,
    대형투기쓰레기류: 2500,
    생활쓰레기류: 1100,
    부표류: 600,
    합계: 8000,
  },
  {
    name: "21 ",
    폐어구류: 3490,
    초목류: 4300,
    대형투기쓰레기류: 2100,
    생활쓰레기류: 1200,
    부표류: 800,
    합계: 9000,
  },
  {
    name: "22 ",
    폐어구류: 4000,
    초목류: 2400,
    대형투기쓰레기류: 2400,
    생활쓰레기류: 1500,
    부표류: 800,
    합계: 4500,
  },
  {
    name: "23 ",
    폐어구류: 3000,
    초목류: 1398,
    대형투기쓰레기류: 2210,
    생활쓰레기류: 1000,
    부표류: 600,
    합계: 5000,
  },
  {
    name: "24 ",
    폐어구류: 2000,
    초목류: 9800,
    대형투기쓰레기류: 2290,
    생활쓰레기류: 1200,
    부표류: 500,
    합계: 7000,
  },
  {
    name: "25 ",
    폐어구류: 2780,
    초목류: 3908,
    대형투기쓰레기류: 2000,
    생활쓰레기류: 1300,
    부표류: 700,
    합계: 7000,
  },
  {
    name: "26 ",
    폐어구류: 1890,
    초목류: 4800,
    대형투기쓰레기류: 2181,
    생활쓰레기류: 900,
    부표류: 400,
    합계: 4000,
  },
  {
    name: "27 ",
    폐어구류: 2390,
    초목류: 3800,
    대형투기쓰레기류: 2500,
    생활쓰레기류: 1100,
    부표류: 600,
    합계: 8000,
  },
  {
    name: "28 ",
    폐어구류: 3490,
    초목류: 4300,
    대형투기쓰레기류: 2100,
    생활쓰레기류: 1200,
    부표류: 800,
    합계: 9000,
  },
  {
    name: "29 ",
    폐어구류: 4000,
    초목류: 2400,
    대형투기쓰레기류: 2400,
    생활쓰레기류: 1500,
    부표류: 800,
    합계: 4500,
  },
  {
    name: "30 ",
    폐어구류: 3000,
    초목류: 1398,
    대형투기쓰레기류: 2210,
    생활쓰레기류: 1000,
    부표류: 600,
    합계: 5000,
  },
  {
    name: "31 ",
    폐어구류: 2000,
    초목류: 9800,
    대형투기쓰레기류: 2290,
    생활쓰레기류: 1200,
    부표류: 500,
    합계: 7000,
  },
];

const BasicStatisticsDailyChart = () => {
  return (
    <ResponsiveContainer width="100%" height={400}>
      <LineChart data={data}>
        <CartesianGrid strokeDasharray="3 3" />
        <XAxis dataKey="name" interval={0} tick={{ fontSize: 16 }} />

        <YAxis />
        <Tooltip />
        <Legend />
        {/* 각 Line에 지정된 색상 적용 */}
        <Line
          type="monotone"
          dataKey="합계"
          stroke="#b0b0b0  "
          strokeWidth={2}
        />
        <Line
          type="monotone"
          dataKey="폐어구류"
          stroke="#4a90e2"
          strokeWidth={2}
        />
        <Line
          type="monotone"
          dataKey="초목류"
          stroke="#8884d8"
          strokeWidth={2}
        />
        <Line
          type="monotone"
          dataKey="대형투기쓰레기류"
          stroke="#82ca9d"
          strokeWidth={2}
        />
        <Line
          type="monotone"
          dataKey="생활쓰레기류"
          stroke="#ffc658"
          strokeWidth={2}
        />
        <Line
          type="monotone"
          dataKey="부표류"
          stroke="#ff8c42"
          strokeWidth={2}
        />
        <Line
          type="monotone"
          dataKey="부표류"
          stroke="#ff8c42"
          strokeWidth={2}
        />
      </LineChart>
    </ResponsiveContainer>
  );
};

export default BasicStatisticsDailyChart;
